# **Pandas Testing**

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('stock_exchange_data/indexData.csv')

In [3]:
df.head()

,Index,Date,Open,High,Low,Close,Adj Close,Volume
0,NYA,1965-12-31,528.690002,528.690002,528.690002,528.690002,528.690002,0.0
1,NYA,1966-01-03,527.210022,527.210022,527.210022,527.210022,527.210022,0.0
2,NYA,1966-01-04,527.840027,527.840027,527.840027,527.840027,527.840027,0.0
3,NYA,1966-01-05,531.119995,531.119995,531.119995,531.119995,531.119995,0.0
4,NYA,1966-01-06,532.070007,532.070007,532.070007,532.070007,532.070007,0.0

In [4]:
df.tail()

,Index,Date,Open,High,Low,Close,Adj Close,Volume
112452,N100,2021-05-27,1241.119995,1251.910034,1241.119995,1247.069946,1247.069946,379696400.0
112453,N100,2021-05-28,1249.469971,1259.209961,1249.030029,1256.599976,1256.599976,160773400.0
112454,N100,2021-05-31,1256.079956,1258.880005,1248.140015,1248.930054,1248.930054,91173700.0
112455,N100,2021-06-01,1254.609985,1265.660034,1254.609985,1258.579956,1258.579956,155179900.0
112456,N100,2021-06-02,1258.489990,1263.709961,1258.239990,1263.619995,1263.619995,148465000.0

In [5]:
df.Index

0          NYA
1          NYA
2          NYA
3          NYA
4          NYA
          ...
112452    N100
112453    N100
112454    N100
112455    N100
112456    N100
Name: Index, Length: 112457, dtype: object

In [6]:
df['Index']

0          NYA
1          NYA
2          NYA
3          NYA
4          NYA
          ...
112452    N100
112453    N100
112454    N100
112455    N100
112456    N100
Name: Index, Length: 112457, dtype: object

In [7]:
df['Index'][0]

'NYA'

## iloc

- Index-based Selection

    Both loc and iloc are row-first, column-second. This is the opposite of what we do in native Python, which is column-first, row-second.

    This means that it's marginally easier to retrieve rows, and marginally harder to get retrieve columns.

In [8]:
df.iloc[0] # retrieve the row at index 0

Index               NYA
Date         1965-12-31
Open         528.690002
High         528.690002
Low          528.690002
Close        528.690002
Adj Close    528.690002
Volume              0.0
Name: 0, dtype: object

In [9]:
df.iloc[:, 1] # retrieve all rows (all indexes), at column 1

0         1965-12-31
1         1966-01-03
2         1966-01-04
3         1966-01-05
4         1966-01-06
             ...
112452    2021-05-27
112453    2021-05-28
112454    2021-05-31
112455    2021-06-01
112456    2021-06-02
Name: Date, Length: 112457, dtype: object

In [10]:
df.iloc[:3, 1] # retrieve first 3 rows, at column 1

0    1965-12-31
1    1966-01-03
2    1966-01-04
Name: Date, dtype: object

In [11]:
df.iloc[[1, 2, 3, 4], 1] # retrieve all rows in the index list, at column 1

1    1966-01-03
2    1966-01-04
3    1966-01-05
4    1966-01-06
Name: Date, dtype: object

In [12]:
df.tail()

,Index,Date,Open,High,Low,Close,Adj Close,Volume
112452,N100,2021-05-27,1241.119995,1251.910034,1241.119995,1247.069946,1247.069946,379696400.0
112453,N100,2021-05-28,1249.469971,1259.209961,1249.030029,1256.599976,1256.599976,160773400.0
112454,N100,2021-05-31,1256.079956,1258.880005,1248.140015,1248.930054,1248.930054,91173700.0
112455,N100,2021-06-01,1254.609985,1265.660034,1254.609985,1258.579956,1258.579956,155179900.0
112456,N100,2021-06-02,1258.489990,1263.709961,1258.239990,1263.619995,1263.619995,148465000.0

In [13]:
df.iloc[-5:] # retrieve last 5 indexes, equivalent to tail()

,Index,Date,Open,High,Low,Close,Adj Close,Volume
112452,N100,2021-05-27,1241.119995,1251.910034,1241.119995,1247.069946,1247.069946,379696400.0
112453,N100,2021-05-28,1249.469971,1259.209961,1249.030029,1256.599976,1256.599976,160773400.0
112454,N100,2021-05-31,1256.079956,1258.880005,1248.140015,1248.930054,1248.930054,91173700.0
112455,N100,2021-06-01,1254.609985,1265.660034,1254.609985,1258.579956,1258.579956,155179900.0
112456,N100,2021-06-02,1258.489990,1263.709961,1258.239990,1263.619995,1263.619995,148465000.0

## loc

- Label-based selection

    The second paradigm for attribute selection is the one followed by the loc operator: label-based selection. In this paradigm, it's the data index value, not its position, which matters.

In [14]:
df.loc[:5, 'Date'] # retrieve first 6 rows, at 'Date' column

0    1965-12-31
1    1966-01-03
2    1966-01-04
3    1966-01-05
4    1966-01-06
5    1966-01-07
Name: Date, dtype: object

In [15]:
df.loc[-5:, ['Date', 'Open', 'Volume']] # this actually returns all rows because negative slicing is not supported in loc

              Date         Open       Volume
0       1965-12-31   528.690002          0.0
1       1966-01-03   527.210022          0.0
2       1966-01-04   527.840027          0.0
3       1966-01-05   531.119995          0.0
4       1966-01-06   532.070007          0.0
...            ...          ...          ...
112452  2021-05-27  1241.119995  379696400.0
112453  2021-05-28  1249.469971  160773400.0
112454  2021-05-31  1256.079956   91173700.0
112455  2021-06-01  1254.609985  155179900.0
112456  2021-06-02  1258.489990  148465000.0

[112457 rows x 3 columns]

## Choosing between loc and iloc

    When choosing or transitioning between loc and iloc, there is one "gotcha" worth keeping in mind, which is that the two methods use slightly different indexing schemes.

    iloc uses the Python stdlib indexing scheme, where the first element of the range is included and the last one excluded. So 0:10 will select entries 0,...,9. loc, meanwhile, indexes inclusively. So 0:10 will select entries 0,...,10.

    Why the change? Remember that loc can index any stdlib type: strings, for example. If we have a DataFrame with index values Apples, ..., Potatoes, ..., and we want to select "all the alphabetical fruit choices between Apples and Potatoes", then it's a lot more convenient to index df.loc['Apples':'Potatoes'] than it is to index something like df.loc['Apples', 'Potatoet'] (t coming after s in the alphabet).

    This is particularly confusing when the DataFrame index is a simple numerical list, e.g. 0,...,1000. In this case df.iloc[0:1000] will return 1000 entries, while df.loc[0:1000] return 1001 of them! To get 1000 elements using loc, you will need to go one lower and ask for df.loc[0:999].

    Otherwise, the semantics of using loc are the same as those for iloc.

In [16]:
sf = pd.DataFrame({'Stock':['Apple', 'Google', 'OpenAI', 'Celsius', 'TIKTAK', 'META', 'HNG', 'XKJ'], 'Price':[100, 320, 482, 883, 432, 399, 732, None], 'Location':['USA', 'CAN', 'CHIL', 'UAE', 'KOR', 'SEB', 'CHI', 'JAP'], 'ETF':['Y', 'Y', 'N', 'N', 'Y', 'Y', 'Y', 'N'], 'Valid': [None, None, None, None, None, None, None, None]})

In [17]:
sf.set_index('Stock', inplace=True) # set index to 'Stock' column, modifying the original DataFrame index

In [18]:
sf.head() # Stock is the indexing column for the DataFrame

         Price Location ETF Valid
Stock
Apple    100.0      USA   Y  None
Google   320.0      CAN   Y  None
OpenAI   482.0     CHIL   N  None
Celsius  883.0      UAE   N  None
TIKTAK   432.0      KOR   Y  None

In [19]:
sf.loc['Google':'TIKTAK', ['Location', 'ETF']]  # retrieve rows from 'Google' to 'TIKTAK', at 'Location' and 'ETF' columns

        Location ETF
Stock
Google       CAN   Y
OpenAI      CHIL   N
Celsius      UAE   N
TIKTAK       KOR   Y

## Conditional Selection

In [20]:
sf.Price > 400  # boolean mask for rows where Price is greater than 400, return a series of True/False

Stock
Apple      False
Google     False
OpenAI      True
Celsius     True
TIKTAK      True
META       False
HNG         True
XKJ        False
Name: Price, dtype: bool

In [21]:
sf.loc[sf['Price'] > 400, :] 
# sf['Price'] > 400 is a series of True/False values indicating whether each row meets the condition, if true the row is included in the result
# in the series of true/false values, if True, the corresponding row is included in the output DataFrame

         Price Location ETF Valid
Stock
OpenAI   482.0     CHIL   N  None
Celsius  883.0      UAE   N  None
TIKTAK   432.0      KOR   Y  None
HNG      732.0      CHI   Y  None

In [22]:
sf.loc[(sf['Price'] > 300) & (sf['ETF'] == 'Y'), ['Location', 'Price', 'ETF']]
# retrieve rows where Price is greater than 300 and ETF is 'Y', at 'Location', 'Price', and 'ETF' columns
# the result this conditonal filtering is from two series of True/False values combined with the & operator

       Location  Price ETF
Stock
Google      CAN  320.0   Y
TIKTAK      KOR  432.0   Y
META        SEB  399.0   Y
HNG         CHI  732.0   Y

In [23]:
sf['Price'] > 399

Stock
Apple      False
Google     False
OpenAI      True
Celsius     True
TIKTAK      True
META       False
HNG         True
XKJ        False
Name: Price, dtype: bool

In [24]:
sf[sf['Price'] > 399] # return a dataframe with only rows where Price is greater than 399

         Price Location ETF Valid
Stock
OpenAI   482.0     CHIL   N  None
Celsius  883.0      UAE   N  None
TIKTAK   432.0      KOR   Y  None
HNG      732.0      CHI   Y  None

In [25]:
sf.loc[sf['Location'].isin(['CHI', 'JAP', 'USA'])] 
# return a dataframe with rows where Location is either 'CHI', 'JAP', or 'USA'

       Price Location ETF Valid
Stock
Apple  100.0      USA   Y  None
HNG    732.0      CHI   Y  None
XKJ      NaN      JAP   N  None

In [26]:
sf.loc[sf.Price.notnull()]  # return a dataframe with rows where Price is not null

         Price Location ETF Valid
Stock
Apple    100.0      USA   Y  None
Google   320.0      CAN   Y  None
OpenAI   482.0     CHIL   N  None
Celsius  883.0      UAE   N  None
TIKTAK   432.0      KOR   Y  None
META     399.0      SEB   Y  None
HNG      732.0      CHI   Y  None

## Markdown Notes:

    iloc vs loc

- iloc 'looking at the position at that index'
- loc 'looks up the index, look for a specific entry'

## Assign

In [27]:
sf['Valid'] = 67 # assign all rows in the series 'Valid' to 67

In [28]:
sf.loc[sf.index == 'Apple', 'Price'] = 1010 # set the 'Price' for the row with index 'Apple' to 1010

In [29]:
print(sf.to_string())

          Price Location ETF  Valid
Stock
Apple    1010.0      USA   Y     67
Google    320.0      CAN   Y     67
OpenAI    482.0     CHIL   N     67
Celsius   883.0      UAE   N     67
TIKTAK    432.0      KOR   Y     67
META      399.0      SEB   Y     67
HNG       732.0      CHI   Y     67
XKJ         NaN      JAP   N     67

In [30]:
sf.iloc[2:7, 0] # this is a series, return only price series

Stock
OpenAI     482.0
Celsius    883.0
TIKTAK     432.0
META       399.0
HNG        732.0
Name: Price, dtype: float64

In [31]:
sf.iloc[2:7, :1] # slices return a dataframe

         Price
Stock
OpenAI   482.0
Celsius  883.0
TIKTAK   432.0
META     399.0
HNG      732.0

In [32]:
sf.loc['OpenAI':'HNG', 'Valid'] = 9999 # from 'OpenAI' to 'HNG' rows, assign the value 9999 to the 'Valid' column

In [33]:
print(sf.to_string())

          Price Location ETF  Valid
Stock
Apple    1010.0      USA   Y     67
Google    320.0      CAN   Y     67
OpenAI    482.0     CHIL   N   9999
Celsius   883.0      UAE   N   9999
TIKTAK    432.0      KOR   Y   9999
META      399.0      SEB   Y   9999
HNG       732.0      CHI   Y   9999
XKJ         NaN      JAP   N     67

In [34]:
sf['Valid'] = range(len(sf), 0, -1) 
# len(sf) returns the number of rows in the DataFrame, so this assigns a descending range of values to the 'Valid' column

In [41]:
print(sf.to_string())

          Price Location ETF  Valid
Stock
Google    320.0      CAN   Y      7
META      399.0      SEB   Y      3
TIKTAK    432.0      KOR   Y      4
OpenAI    482.0     CHIL   N      6
HNG       732.0      CHI   Y      2
Celsius   883.0      UAE   N      5
Apple    1010.0      USA   Y      8
XKJ         NaN      JAP   N      1

In [42]:
sf.sort_values(by='Price', inplace=True)

In [45]:
print(sf.to_string())

          Price Location ETF  Valid
Stock
Google    320.0      CAN   Y      7
META      399.0      SEB   Y      3
TIKTAK    432.0      KOR   Y      4
OpenAI    482.0     CHIL   N      6
HNG       732.0      CHI   Y      2
Celsius   883.0      UAE   N      5
Apple    1010.0      USA   Y      8
XKJ         NaN      JAP   N      1

In [46]:
sf.sort_values(by='Valid').loc[:, ['Price', 'Valid']] 
# sort by 'Valid' column and return the 'Price' column

          Price  Valid
Stock
XKJ         NaN      1
HNG       732.0      2
META      399.0      3
TIKTAK    432.0      4
Celsius   883.0      5
OpenAI    482.0      6
Google    320.0      7
Apple    1010.0      8

In [47]:
print(sf)

          Price Location ETF  Valid
Stock
Google    320.0      CAN   Y      7
META      399.0      SEB   Y      3
TIKTAK    432.0      KOR   Y      4
OpenAI    482.0     CHIL   N      6
HNG       732.0      CHI   Y      2
Celsius   883.0      UAE   N      5
Apple    1010.0      USA   Y      8
XKJ         NaN      JAP   N      1

In [48]:
max_price = sf['Price'] < 600
type = sf['ETF'].isin(['Y'])

sf.loc[max_price & type, :]

        Price Location ETF  Valid
Stock
Google  320.0      CAN   Y      7
META    399.0      SEB   Y      3
TIKTAK  432.0      KOR   Y      4

## Summary of Functions / Maps


        However, the data does not always come out of memory in the format we want it in right out of the bat. Sometimes we have to do some more work ourselves to reformat it for the task at hand. This tutorial will cover different operations we can apply to our data to get the input "just right".

In [49]:
print(sf.to_string())

          Price Location ETF  Valid
Stock
Google    320.0      CAN   Y      7
META      399.0      SEB   Y      3
TIKTAK    432.0      KOR   Y      4
OpenAI    482.0     CHIL   N      6
HNG       732.0      CHI   Y      2
Celsius   883.0      UAE   N      5
Apple    1010.0      USA   Y      8
XKJ         NaN      JAP   N      1

In [50]:
sf.describe() # returns a dataframe with statistical summary of all numeric columns

             Price    Valid
count     7.000000  8.00000
mean    608.285714  4.50000
std     266.483717  2.44949
min     320.000000  1.00000
25%     415.500000  2.75000
50%     482.000000  4.50000
75%     807.500000  6.25000
max    1010.000000  8.00000

In [51]:
sf.Price.describe() # returns a series with statistical summary of the 'Price' column

count       7.000000
mean      608.285714
std       266.483717
min       320.000000
25%       415.500000
50%       482.000000
75%       807.500000
max      1010.000000
Name: Price, dtype: float64

In [52]:
sf.Price.mean() # returns the mean of the 'Price' column

np.float64(608.2857142857143)

In [53]:
sf.Location.unique() # returns an array of unique values in the 'array' column

array(['CAN', 'SEB', 'KOR', 'CHIL', 'CHI', 'UAE', 'USA', 'JAP'],
      dtype=object)

In [54]:
sf.ETF.value_counts() # returns a series with counts of unique values in the 'ETF' column

ETF
Y    5
N    3
Name: count, dtype: int64

In [ ]:
sf.count() # count non-null entries for each column

Price       7
Location    8
ETF         8
Valid       8
dtype: int64

In [58]:
price_mean = sf.Price.mean() # returns the mean of the 'Price' column

print('Price Mean:',price_mean)

sf.Price.map(lambda x: x - price_mean) # return a series of the form (current index value - mean) for each index in the 'Price' column

Price Mean: 608.2857142857143

Stock
Google    -288.285714
META      -209.285714
TIKTAK    -176.285714
OpenAI    -126.285714
HNG        123.714286
Celsius    274.714286
Apple      401.714286
XKJ               NaN
Name: Price, dtype: float64

In [59]:
import random

def randrow(row):
    row.Valid = random.randint(0, 10)
    return row

sf.apply(randrow, axis='columns') # this does not modify the original DataFrame

          Price Location ETF  Valid
Stock
Google    320.0      CAN   Y      4
META      399.0      SEB   Y      7
TIKTAK    432.0      KOR   Y      4
OpenAI    482.0     CHIL   N      5
HNG       732.0      CHI   Y      6
Celsius   883.0      UAE   N      1
Apple    1010.0      USA   Y     10
XKJ         NaN      JAP   N      7

In [77]:
print(sf.to_string())

          Price Location ETF  Valid
Stock
Google    320.0      CAN   Y      1
META      399.0      SEB   Y      1
TIKTAK    432.0      KOR   Y      1
OpenAI    482.0     CHIL   N      1
HNG       732.0      CHI   Y      1
Celsius   883.0      UAE   N      1
Apple    1010.0      USA   Y      1
XKJ         NaN      JAP   N      1

In [ ]:
randrow(sf) # this modifies the original DataFrame 
# called with the whole DataFrame (row is the DataFrame)
# mutates sf in-place because you passed the DataFrame

          Price Location ETF  Valid
Stock
Google    320.0      CAN   Y      5
META      399.0      SEB   Y      5
TIKTAK    432.0      KOR   Y      5
OpenAI    482.0     CHIL   N      5
HNG       732.0      CHI   Y      5
Celsius   883.0      UAE   N      5
Apple    1010.0      USA   Y      5
XKJ         NaN      JAP   N      5

In [79]:
print(sf.to_string())

          Price Location ETF  Valid
Stock
Google    320.0      CAN   Y      5
META      399.0      SEB   Y      5
TIKTAK    432.0      KOR   Y      5
OpenAI    482.0     CHIL   N      5
HNG       732.0      CHI   Y      5
Celsius   883.0      UAE   N      5
Apple    1010.0      USA   Y      5
XKJ         NaN      JAP   N      5

In [80]:
sf.Valid = range(len(sf), 0, -1) # revert values back

In [81]:
print(sf.to_string())

          Price Location ETF  Valid
Stock
Google    320.0      CAN   Y      8
META      399.0      SEB   Y      7
TIKTAK    432.0      KOR   Y      6
OpenAI    482.0     CHIL   N      5
HNG       732.0      CHI   Y      4
Celsius   883.0      UAE   N      3
Apple    1010.0      USA   Y      2
XKJ         NaN      JAP   N      1

In [82]:
sf.Price - price_mean # built in mapping operation

Stock
Google    -288.285714
META      -209.285714
TIKTAK    -176.285714
OpenAI    -126.285714
HNG        123.714286
Celsius    274.714286
Apple      401.714286
XKJ               NaN
Name: Price, dtype: float64

In [83]:
sf.Location + " - " + sf.ETF # concatenate strings from 'Location' and 'ETF' columns with " - " in between

Stock
Google      CAN - Y
META        SEB - Y
TIKTAK      KOR - Y
OpenAI     CHIL - N
HNG         CHI - Y
Celsius     UAE - N
Apple       USA - Y
XKJ         JAP - N
dtype: object